EJBServer/components/BDM/axis/ca/gc/bdm/address/sample request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://GoC/ServiceCanada/SoftwareFactory/WebServices/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:Execute>
            <web:strXMLInput>
                <![CDATA[
                    <WSMessage>
                        <ApplicationIDs>
                            <TopApplicationID>ISP</TopApplicationID>
                            <ParentApplicationID/>
                            <CurrentApplicationID>ISP</CurrentApplicationID>
                        </ApplicationIDs>
                        <TransactionIDs>
                            <TopTransactionID>cc9f6971-ce5b-497a-b043-7813630c5f64</TopTransactionID>
                            <ParentTransactionID/>
                            <CurrentTransactionID>17d2723e-901b-4f7b-978a-73a29f7a1b0d</CurrentTransactionID>
                        </TransactionIDs>
                        <SecurityContext>
                            <TransactionID>732cb0a5-3667-4649-9929-7010f091ffc0</TransactionID>
                            <Authentication>
                                <Client>
                                    <Identity>
                                        <ID/>
                                        <Name/>
                                        <IPAddress/>
                                        <MachineName/>
                                    </Identity>
                                    <Role/>
                                </Client>
                                <Employee>
                                    <Identity>
                                        <ID/>
                                        <Name/>
                                        <IPAddress/>
                                        <MachineName/>
                                    </Identity>
                                    <Role/>
                                </Employee>
                                <Application>
                                    <Identity>
                                        <ID/>
                                        <Name>TestWebServices</Name>
                                        <Version>1.0</Version>
                                        <IPAddress/>
                                        <MachineName/>
                                    </Identity>
                                    <Role/>
                                </Application>
                                <AssuranceLevel/>
                            </Authentication>
                            <Authorization>
                                <RequestDescription/>
                                <Request/>
                                <TransactionID/>
                                <TimeStamp>
                                    <BeginDateTime/>
                                    <EndDateTime/>
                                </TimeStamp>
                            </Authorization>
                        </SecurityContext>
                        <Input>
                            <Settings>
                                <Setting Name="IncludeCurrentVersion">False</Setting>
                                <Setting Name="IncludeInputSection">False</Setting>
                                <Setting Name="IncludeOutputSettings">False</Setting>
                                <Setting Name="IncludeRequestWithResult">True</Setting>
                            </Settings>
                            <AllRequests>
                                <Requests>
                                    <Request Name="Search">
                                        <InputParameters>
                                            <Parm Name="Language" Base64Encoded="False">English</Parm>
                                            <Parm Name="GeographicScope" Base64Encoded="False">Canada</Parm>
                                            <Parm Name="AddressLine" Base64Encoded="False">500 rue du Binôme, Québec, QC</Parm>
                                            <Parm Name="City" Base64Encoded="False">Québec City</Parm><Parm Name="Province" Base64Encoded="False">QC</Parm>
                                            <Parm Name="PostalCode" Base64Encoded="False">G1P4P1</Parm><Parm Name="Country" Base64Encoded="False">CAN</Parm>
                                        </InputParameters>
                                    </Request>
                                </Requests>
                            </AllRequests>
                        </Input>
                    </WSMessage>
                ]]>
            </web:strXMLInput>                
        </web:Execute>
    </soapenv:Body>
</soapenv:Envelope>